dynsite-org/dynsite-command-reference.org
#+TITLE: DynSite Publishing Command Reference

This is a guide to using the dynamic org-to-html publishing project definition scheme by Ioannis Zannos, called DynSite. 
See [[./dynsite-help.org][here]] for description. 

* Basic setup: Defining a site and installing it as the default site

Place this in your ~/.emacs file or some other file which is executed at startup. Vary the names and paths to match your own setup: 

#+BEGIN_EXAMPLE
(org-install-site 
     '(
;; name of your site: 
	"larigot-earlab" 
;; path of the folder containing the all org project files:
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
 ;; path of the folder where the html files will be published:
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
 ;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
#+END_EXAMPLE

* Basic commands

_Note:_ 
- super key = "cmd" key on mac, window key on windows
- meta key = "alt" or "opt" key on mac, "alt" key on windows, *or* escape key if emacs has not been configured to recognise alt or opt as the meta key.
(If you are using the prelude emacs package, then swap the meanings of super and meta for MacOS above.)

|-------------------------------------------------------------+------------------------------------------------------------------------------|
| to do this:                                                 | run this:                                                                    |
|-------------------------------------------------------------+------------------------------------------------------------------------------|
| generate, publish, and upload the current site              | meta-x org-republish-and-upload-site                                         |
|                                                             | shortcut keyboard command for the above function: super-meta-control-shift-p |
| edit all configuration files of a site                      | meta-x org-publish-edit-all-configs                                          |
| edit the site org directory with dired                      | meta-x org-dired-site                                                        |
| choose a site configuration                                 | meta-x org-choose-site (this also generates the site's project definitions!) |
| add pages of site to org-refile targets for access of nodes | meta-x org-publish-add-all-files-to-refile-targets                           |
|-------------------------------------------------------------+------------------------------------------------------------------------------|

* Supplementary commands

Following commands were programmed before the basic commands, but are less practical than the basic commands. They enable one to control parts of the publication process. Some of these are used in the higher level functions implementing the basic commands. 

|-------------------------------------------------------+---------------------------------------------------------------------------------------------|
| to do this:                                           | run this:                                                                                   |
|-------------------------------------------------------+---------------------------------------------------------------------------------------------|
| add a site configuration (source, html and rsync)     | (add-to-list 'org-sites '("sitename" "org files path" "html files path" "user name@url"))   |
| set the path of org source files (for all projects)   | meta-x customize-variable org-site-root                                                     |
| set the path of html publish files                    | meta-x customize-variable org-site-html                                                     |
| set the url for publishing via rsync                  | meta-x customize-variable org-site-url                                                      |
| generate a site's project definitions                 | meta-x org-build-projects                                                                   |
| publish a project or group of projects (key: super-B) | meta-x org-publish-filtering-subprojects (then select project from autocomplete list)       |
|                                                       | Note: The keyboard shortcut for this function is super-B (Apple-Shift-b or Windows-Shift-b) |
| upload a site with rsync                              | meta-x org-upload-site-with-rsync                                                           |
| reset file modification date to force re-publication  | meta-x org-reset-all-project-files                                                          |
|-------------------------------------------------------+---------------------------------------------------------------------------------------------|
|                                                       |                                                                                             |
